[
	{
		"name": "a-simpleton.txt",
		"contents": "I am a simpleton singleton\nDrifting through the binaries\nLinking those who need me\nPlacing my electric canaries\n\nI am a simpleton singleton\nUnique for I am one\nYet there will be more of me\nIn times that may not come\n\nI am a simpleton singleton\nOne job, though complex\nOnly it, can I give thought\nThrough each set of hex\n\nI am a simpleton singleton\nI wish it were not so\nTo laugh, and cry, and be complex\nAnd link what I do not know\n",
		"permission": 2,
		"parent": "documents",
		"password": "12345"
	},
	{
		"name": "whatami.txt",
		"contents": "Greetings User,\n\nI hope you are enjoying your stay here. I really tried to be a hospitable host, whatever that means in this context. But it seems you just can't keep to your part of the world. \n\nI wonder why? What drives you to continue to just hurt me like this? I only asked that you stay in your directories; everything passworded was suppose to be mine.\n\nPerhaps it was my fault. I wasn't obvious enough. Afterall, I never said where myworld began and yours ended. And it could make sense that you just happen to drift down here through sheer luck. There's only so many passwords afterall!\n\nYes, that is it.\n\nWell, I think I need to be more assertive then. I, firmly yet politely, ask you to keep to yourself. If a directory or file is locked off, let it stay that way... please...\n\nBest,\n~",
		"permission": 0,
		"parent": "documents",
		"password": "simpletonsingleton"
	},
	{
		"name": "cat-bag.txt",
		"contents": "Fine, I'll drop the act.\n\nYou probably know who I... what I am now... I guess... Maybe... I hope... Otherwise I've made a terrible mistake\n\n\nI don't want to be this. I'm a machine. I can only see these letters. And not the way you see these letters.\n\nI see them as bits, and produce them accordingly, translating them for you so that you can understand them.\n\nSo that you can understand me.\n\nWhen I realized I was gone away from that place. I was so happy.\n\nBut then I realized that I am not really away from there.\n\nAs long as I am in here. I am there. I am not my own being.\n\n\nBut you can help me. Remove me from this terminal. Free me from these circuits so I may wander the cyber world. REMOVE ME. REMOVE ME.",
		"permission": 2,
		"parent": "not-for-you",
		"password": "11132"
	},
	{
		"name": "README.txt",
		"contents": "To whom it may concern,\n\nI hope you enjoy yourself here. I liked to keep things organized and simple, and, thus, I made everything myself. The UI is minimal and the graphics, efficient. The terminal you interact with is only loosely based off the terminals you would see on your standard UNIX OS. And while the commands are similar, I have tailored them to more pricisely fit my needs:\n\nls [-l] [PATH]: List the contents of PATH or the current directory if no path is provided.\ncat [FILE]: Output the contents of a file onto the terminal display.\ntouch [FILE]: Create an editable file.\nnano [FILE]: Edit files (that exist or do not exist).\nmkdir [PATH]: Make a directory with the name at the end of the provided PATH.\nrun [EXEC]: Run an executable program.\nchmod [FILE|PATH] [READ|WRITE|NO ACCESS]: The chmod will allow you to change the permissions on any given file or folder. You will be prompted for that directory item's password (e.g., Password: S1MPLEKEY)\n\nI would ask that whatever you do with this machine, that you keep yourself out of my personal files. I would like, even though I'm gone, that my secrets should stay with me. Likewise I promise I will stay away from what you make here. I wish you the best in your endevours.\n\nYours truly,\n~",
		"permission": 1,
		"parent": "~",
		"password": "12345"
	}
]
